app/controllers/proteins_controller.rb

  def index
    @protein = Protein.all
---
SELECT "proteins".* FROM "proteins"